"""შექმენით მასივი, for ციკლით მასივში დაამატეთ 0_იდან 50_ის ჩათვლით რიცხვები,
 შემდეგ 0_იდან 25_ე ინდექსის ჩათვლით გამოიტანეთ რიცხვები"""

# 1)

num = []

for i in range(51):
    num.append(i)
print(num)
print(num[0:26])

print(num[0:51:3])

#end


# 2)

"""მომხმარებელს შეეკითხეt რიცხვი, შემდეგ for ციკლით start პოზიციიდან
ეს რიცხვი,ხოლო end_იდან ამ რიცხვზე 10_ით მეტი აიღეთ და ყველა რიცხვი 
ჩაამატეტ ახალ სიაში, სიიდან გამოიტანეთ ელემენტები 2 ინდექსის გამოტოვებით"""

# num1 = int(input("Please enter whole number: "))
# num2 = num1 + 11

# number_list = []

# for i in range(num1, num2):
#     list.append(i)
# print(list)
# print(list[0:-1:2])
