
# დავწერო რას ვფიქრობ გოაზე.

print("გოა არის ადგილი სადაც შეგიძლია განვითარდე არა მარტო პროგრამირების მხრივ არამედ ცხოვრებისეულადაც")
print("პირველი გაკვეთილიდანაც მივხვდი თუ როგორი კარგი დამოკიდებულება აქვს მენტორებს და რაზმის ლიდერებს თავისი სტუდენტების მიმართ")
print("აქ არის ყველაზე კომფორტული გარემო, ონლაინ ასე კარგად არასდროს არ მომწონებია გაკვეთილზე შესვლა, ასეთი დიდი მოტივაცია სწავლისთვის არასდროს მქონია")
print("აქ მივხვდი რომ მთავარია მონდომება და ყველაფერი გამოგივა, გოა არის პროფესიონალებით დაკომპლექტებული გუნდი რომელიც ყველაფერს აკეთებს თავისი სტუდენტების განვითარებისთვის")
print("გოაში პირველი გაკვეთილის შემდეგ მივხვდი რომ აქ ვისწავლი ყველაფერს რაც აუცილებელია ჩემი განვითარებისთვის არა მარტო პროგრამირების მხრივ არამედ ცხოვრებისეულადაც")
print("გოაში პროგრამირებას ასწვალიან ყველაზე სწორი მიდგომით უნუვერსიტეტებისგან განსხვავებით, აქ მოსწავლეებს სწორად უდგებიან და იციან თუ არის მათთვის საჭირო")



